---
kind: type
id: T:Autodesk.Revit.DB.HasValueFilterRule
source: html/6c59692e-a490-d3df-9020-f7a130503ecc.htm
---
# Autodesk.Revit.DB.HasValueFilterRule

Tests whether an element's parameter has a value.

## Syntax (C#)
```csharp
public class HasValueFilterRule : ParameterValuePresenceRule
```